var parentParam, tempCitydata = {};
var changeParent = function(a) {
    parent.changeData(a)
};
function initTooltip() {
    $.getJSON("js/ptjsqk.json",
        function(a) {
            tempCitydata = a;
            return a
        })
}
require.config({
    paths: {
        echarts: "./js"
    }
});
require(["echarts", "echarts/chart/map"],
    function(b) {
        var a = require("echarts/config");
        var g = [];
        initTooltip();
        var d = {
            title: {
                text: "河南护校安园管理平台",
                subtext: "河南省",
                textStyle: {
                    fontSize: 26,fontFamily:'微软雅黑',
                    fontWeight: "400",
                    color: "#fff"
                },
                subtextStyle: {
                    fontSize: 14,fontFamily:'微软雅黑',
                    fontWeight: "100",
                    color: "#fff"
                },
                itemGap:15
            },
            tooltip: {
                trigger: "item",
                textStyle:{fontSize:14},
                formatter: function(i) {
                    return i[1] + "<br/>学校：" + tempCitydata[i[1]].school + "所<br/>监控点：" + tempCitydata[i[1]].jksl + "个<br/>球机：" + tempCitydata[i[1]].qj + " 个<br/>枪机：" + tempCitydata[i[1]].qj1 + "个"
                }
            },
            series: [{
                name: "随机数据",
                type: "map",
                mapType: "河南",
                selectedMode: "single",
                itemStyle: {
                    normal: {
                        label: {
                            show: true,
                            textStyle: {
                                color: "#333",fontFamily:'微软雅黑'
                            }
                        },
                        color: "#eee",
                        borderWidth: 1,
                        borderColor: "#03a4e5"
                    },
                    emphasis: {
                        label: {
                            show: true
                        }
                    }
                },
                data: []
            }]
        };

        var f = b.init(document.getElementById("mainMap"));
        var e = {
            "郑州市": "410100",
            "开封市": "410200",
            "洛阳市": "410300",
            "平顶山市": "410400",
            "安阳市": "410500",
            "鹤壁市": "410600",
            "新乡市": "410700",
            "焦作市": "410800",
            "濮阳市": "410900",
            "许昌市": "411000",
            "漯河市": "411100",
            "三门峡市": "411200",
            "南阳市": "411300",
            "商丘市": "411400",
            "信阳市": "411500",
            "周口市": "411600",
            "驻马店市": "411700",
            "安阳县": "410522",
            "宝丰县": "410421",
            "北关区": "410503",
            "博爱县": "410822",
            "瀍河回族区": "410304",
            "沈丘县": "411624",
            "川汇区": "411602",
            "郸城县": "411625",
            "登封市": "410185",
            "邓州市": "411381",
            "二七区": "410103",
            "范县": "410926",
            "方城县": "411322",
            "封丘县": "410727",
            "凤泉区": "410704",
            "扶沟县": "411621",
            "巩义市": "410181",
            "鼓楼区": "410204",
            "固始县": "411525",
            "管城回族区": "410104",
            "光山县": "411522",
            "鹤山区": "410602",
            "红旗区": "410702",
            "湖滨区": "411202",
            "华龙区": "410902",
            "滑县": "410526",
            "淮滨县": "411527",
            "淮阳县": "411626",
            "潢川县": "411526",
            "辉县市": "410782",
            "惠济区": "410108",
            "获嘉县": "410724",
            "吉利区": "410306",
            "济源市": "419001",
            "郏县": "410425",
            "涧西区": "410305",
            "解放区": "410802",
            "金水区": "410105",
            "浚县": "410621",
            "兰考县": "410225",
            "老城区": "410302",
            "梁园区": "411402",
            "林州市": "410581",
            "临颍县": "411122",
            "灵宝市": "411282",
            "龙安区": "410506",
            "龙亭区": "410202",
            "卢氏县": "411224",
            "鲁山县": "410423",
            "鹿邑县": "411628",
            "栾川县": "410324",
            "罗山县": "411521",
            "洛龙区": "410311",
            "洛宁县": "410328",
            "马村区": "410804",
            "孟津县": "410322",
            "孟州市": "410883",
            "泌阳县": "411726",
            "渑池县": "411221",
            "民权县": "411421",
            "牧野区": "410711",
            "南乐县": "410923",
            "南召县": "411321",
            "内黄县": "410527",
            "内乡县": "411325",
            "宁陵县": "411423",
            "平桥区": "411503",
            "平舆县": "411723",
            "濮阳县": "410928",
            "淇滨区": "410611",
            "淇县": "410622",
            "杞县": "410221",
            "沁阳市": "410882",
            "清丰县": "410922",
            "确山县": "411725",
            "汝南县": "411727",
            "汝阳县": "410326",
            "汝州市": "410482",
            "山城区": "410603",
            "山阳区": "410811",
            "陕县": "411222",
            "商城县": "411524",
            "商水县": "411623",
            "上蔡县": "411722",
            "上街区": "410106",
            "社旗县": "411327",
            "浉河区": "411502",
            "石龙区": "410404",
            "顺河回族区": "410203",
            "嵩县": "410325",
            "睢县": "411422",
            "睢阳区": "411403",
            "遂平县": "411728",
            "台前县": "410927",
            "太康县": "411627",
            "汤阴县": "410523",
            "唐河县": "411328",
            "通许县": "410222",
            "桐柏县": "411330",
            "宛城区": "411302",
            "卫滨区": "410703",
            "卫东区": "410403",
            "卫辉市": "410781",
            "尉氏县": "410223",
            "魏都区": "411002",
            "温县": "410825",
            "文峰区": "410502",
            "卧龙区": "411303",
            "武陟县": "410823",
            "舞钢市": "410481",
            "舞阳县": "411121",
            "淅川县": "411326",
            "西工区": "410303",
            "西华县": "411622",
            "西平县": "411721",
            "西峡县": "411323",
            "息县": "411528",
            "夏邑县": "411426",
            "襄城县": "411025",
            "祥符区": "祥符区",
            "项城市": "411681",
            "新安县": "410323",
            "新蔡县": "411729",
            "新华区": "410402",
            "新密市": "410183",
            "新县": "411523",
            "新乡县": "410721",
            "新野县": "411329",
            "新郑市": "410184",
            "荥阳市": "410182",
            "修武县": "410821",
            "许昌县": "411023",
            "鄢陵县": "411024",
            "延津县": "410726",
            "偃师市": "410381",
            "郾城区": "411103",
            "叶县": "410422",
            "伊川县": "410329",
            "义马市": "411281",
            "驿城区": "411702",
            "宜阳县": "410327",
            "殷都区": "410505",
            "永城市": "411481",
            "虞城县": "411425",
            "禹王台区": "410205",
            "禹州市": "411081",
            "原阳县": "410725",
            "源汇区": "411102",
            "湛河区": "410411",
            "长葛市": "411082",
            "长垣县": "410728",
            "召陵区": "411104",
            "柘城县": "411424",
            "镇平县": "411324",
            "正阳县": "411724",
            "中牟县": "410122",
            "中原区": "410102",
            "中站区": "410803",
            "开封县": "410224",
            "金明区": "410211",
            "高新区": "高新区",
            "伊滨区": "伊滨区"
        };
        var c = require("echarts/util/mapData/params");
        for (var h in e) {
            g.push(h);
            c.params[h] = {
                getGeoJson: (function(j) {
                    var i = e[j];
                    return function(k) {
                        $.getJSON("js/geoJson/china-main-city/" + i + ".json", k)
                    }
                })(h)
            }
        }
        f.setOption(d);
        f.on(a.EVENT.DBLCLICK,
            function() {
                parentParam = "河南";
                changeParent(parentParam);
                d.series[0].mapType=parentParam;
                f.setOption(d, true)
            });
        f.on(a.EVENT.MAP_SELECTED,
            function(i) {
                parentParam = i.target;
                changeParent(parentParam);
                d.series[0].mapType = i.target;
                d.title.subtext = i.target + " （双击地图可回到河南省地图）";
                d.series[0].data = [];
                f.setOption(d, true)
            });

    });